#include <bits/stdc++.h>

using namespace std;

int main() {
	string 参与者, 事件, 另一种说法;
	cout << "营销号生成器 by mail_set\n";
	cout << "请输入参与者：";
	cin >> 参与者;
	cout << "\n请输入事件：";
	cin >> 事件;
	cout << "\n请输入另一种说法：";
	cin >> 另一种说法;
	cout << "\n    "  << 参与者<< 事件 << "是怎么回事呢？" << 参与者 << "相信大家都很熟悉，但是" << 参与者 << 事件 << "是什么回事呢，下面就让小编带大家一起了解吧。\n";
	cout << "    " << 参与者 << 事件 << ",其实就是" << 另一种说法 << ",大家可能会很惊讶" << 参与者 << "怎么会" << 事件 << "呢？但事实就是这样，小编也感到非常惊讶。\n";
	cout << "    这就是关于" << 参与者 << 事件 << "的事情了，大家有什么想法呢？欢迎在评论区告诉小编一起讨论哦！\n";
	system("pause");
}